Autodesk.Revit.DB.FlowDirectionType
An enumerated type listing direction types for a connector.

Autodesk.Revit.DB.FlowDirectionType.Out
Flow out

Autodesk.Revit.DB.FlowDirectionType.In
Flow in

Autodesk.Revit.DB.FlowDirectionType.Bidirectional
Flow bidirectional